Terraform plan result:

```
data.aws_s3_bucket.lambda_code: Reading...
aws_iam_role.lambda_exec: Refreshing state... [id=emenu_lambda_exec_role]
aws_iam_role.appsync_lambda_role: Refreshing state... [id=appsync-lambda-invoke-role]
aws_iam_role.cognito_trigger: Refreshing state... [id=emenu_cognito_post_confirmation_role]
aws_appsync_graphql_api.emenu_apis: Refreshing state... [id=2zwnjoxkxfhofcvenuwlbz3koa]
aws_iam_role_policy_attachment.lambda_basic_execution: Refreshing state... [id=emenu_lambda_exec_role-20250608114716565600000001]
aws_iam_role_policy_attachment.cognito_lambda_execution: Refreshing state... [id=emenu_cognito_post_confirmation_role-20250622110430595600000001]
aws_iam_role_policy.cognito_admin_group_access: Refreshing state... [id=emenu_cognito_post_confirmation_role:AllowCognitoAdminGroupAccess]
aws_appsync_api_key.emenu_api_key: Refreshing state... [id=2zwnjoxkxfhofcvenuwlbz3koa:da2-nq33zol6gnbhpcbcvz4eu6tbua]
data.aws_s3_bucket.lambda_code: Read complete after 2s [id=emenu-lambda-code-bucket]
data.aws_s3_object.lambda_layer: Reading...
data.aws_s3_object.lambda_layer: Read complete after 0s [id=emenu-lambda-code-bucket/layers/common_models/common_models_layer.zip]
aws_lambda_layer_version.common_mongoose_models: Refreshing state... [id=arn:aws:lambda:ap-southeast-2:205930647566:layer:common_mongoose_models:7]
aws_lambda_function.emenu_server: Refreshing state... [id=emenu-server]
aws_lambda_function.emenu_post_confirmation: Refreshing state... [id=emenu_post_confirmation]
aws_iam_role_policy.appsync_invoke_lambda: Refreshing state... [id=appsync-lambda-invoke-role:appsync-invoke-lambda]
aws_appsync_datasource.emenu_datasource: Refreshing state... [id=2zwnjoxkxfhofcvenuwlbz3koa-emenu_datasource]
aws_appsync_resolver.list_dishes_query: Refreshing state... [id=2zwnjoxkxfhofcvenuwlbz3koa-Query-listDishes]
aws_appsync_resolver.create_restaurant_mutation: Refreshing state... [id=2zwnjoxkxfhofcvenuwlbz3koa-Mutation-createRestaurant]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_appsync_api_key.emenu_api_key will be updated in-place
  ~ resource "aws_appsync_api_key" "emenu_api_key" {
      ~ expires     = "2025-07-23T06:00:00Z" -> (known after apply)
        id          = "2zwnjoxkxfhofcvenuwlbz3koa:da2-nq33zol6gnbhpcbcvz4eu6tbua"
        # (4 unchanged attributes hidden)
    }

  # aws_lambda_function.emenu_post_confirmation will be updated in-place
  ~ resource "aws_lambda_function" "emenu_post_confirmation" {
        id                             = "emenu_post_confirmation"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-2:205930647566:layer:common_mongoose_models:7",
        ] -> (known after apply)
        tags                           = {}
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.emenu_server will be updated in-place
  ~ resource "aws_lambda_function" "emenu_server" {
        id                             = "emenu-server"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-2:205930647566:layer:common_mongoose_models:7",
        ] -> (known after apply)
        tags                           = {}
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_layer_version.common_mongoose_models must be replaced
-/+ resource "aws_lambda_layer_version" "common_mongoose_models" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-2:205930647566:layer:common_mongoose_models:7" -> (known after apply)
      ~ code_sha256                 = "df5pS7E+eCKm8c1SdTVKJS70SERUtXiPc7Hx9kdaYqw=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-06-23T06:39:14.404+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-2:205930647566:layer:common_mongoose_models:7" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-2:205930647566:layer:common_mongoose_models" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "1e8e2fb070a0e2ca4f376d55a03c1f1b" -> "53c70d8f0a1b2922cbc7f2729e09e836" # forces replacement
      ~ source_code_size            = 2780266 -> (known after apply)
      ~ version                     = "7" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

Plan: 1 to add, 3 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...
```

Please approve to proceed.
